Netgear/wnce4004/0x42D120/package2.raw

POST /apply.cgi HTTP/1.1
Host: example.com
Content-Type: text/xml; charset=utf-8
Content-Length: 500
SOAPAction: "http://example.com/weather:service:DeviceConfig:#ConfigurationStarted"

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <getWeather xmlns="http://example.com/weather">
            <cityName>Shanghai</cityName>
        </getWeather>
    </soap:Body>
</soap:Envelope>